"""
1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()), который должен
принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц вы найдете в методичке.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух
матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем с
первым элементом первой строки второй матрицы и т.д.
"""


class Matrix:
    def __init__(self, __source_list):
        self.__source_list = __source_list

    def __str__(self):
        return '{}'.format(''.join(['\t'.join(s) + '\n' for s in self.__source_list]))


source_matrix = [['42', '80'], ['-17', '-34'], ['97', '80'], ['63', '-9'], ['-32', '11']]
mtx = Matrix(source_matrix)
print(mtx)
